org/cs-1.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-12-06 Sun 17:26>
#+TITLE: 第 1 章 计算机系统漫游

_计算机系统_ 是由硬件和系统软件组成的，它们共同工作来运行应用程序。虽然系统的具体实现方式随着时间不断变化，但是 *系统内在的概念却没有改变* 。所有计算机系统都有相似的硬件和软件组件，它们又执行着相似的功能。一些程序员希望深入了解这些组件是如何工作的以及这些组件是如何影响程序的正确性和性能的，以此来提高自身的技能。本书便是为这些读者而写的。

现在就要开始一次有趣的漫游历程了。如果你全力投身学习本书中的概念，完全理解底层计算机系统以及它对应用程序的影响，那么你会步上成为为数不多的“大牛”的道路。

